---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Category..::..GetCategory Method
Category Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetCategory(Document, BuiltInCategory) | Retrieves a category object corresponding to a BuiltInCategory id. |
|  | GetCategory(Document, ElementId) | Retrieves a category object corresponding to the category id. |

# See Also

Category Class

Category Members

Autodesk.Revit.DB Namespace